{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": false,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer",
              "inputShape": [
                1059,
                768
              ]
            }
          },
          {
            "class_name": "Masking",
            "config": {
              "name": "masking",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "mask_value": 0.0
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "merge_mode": "concat",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "forward_lstm",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.4,
                  "recurrent_dropout": 0.2,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    264,
                    128
                  ]
                }
              },
              "backward_layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "backward_lstm",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": true,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.4,
                  "recurrent_dropout": 0.2,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    264,
                    128
                  ]
                }
              }
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "merge_mode": "concat",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "forward_lstm_1",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.4,
                  "recurrent_dropout": 0.2,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    264,
                    256
                  ]
                }
              },
              "backward_layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "backward_lstm_1",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": true,
                  "stateful": false,
                  "unroll": false,
                  "zero_output_for_mask": true,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null,
                      "gain": 1.0
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.4,
                  "recurrent_dropout": 0.2,
                  "seed": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    264,
                    256
                  ]
                }
              }
            }
          },
          {
            "class_name": "GlobalMaxPooling1D",
            "config": {
              "name": "global_max_pooling1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 9,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Constant",
                "config": {
                  "value": {
                    "class_name": "__numpy__",
                    "config": {
                      "value": [
                        -0.6517619644851192,
                        -0.8209805521531637,
                        -0.693147180646751,
                        0.07410797203352959,
                        -1.025852934464298,
                        -1.8245492921182502,
                        -3.1950651762347233,
                        -1.9672442915962676,
                        0.0
                      ],
                      "dtype": "float64"
                    }
                  }
                },
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [
          null,
          1059,
          768
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "loss_weights": null,
      "metrics": [
        "mae",
        "binary_accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 9.999999747378752e-05,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm/lstm_cell/kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm/lstm_cell/kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm_1/lstm_cell/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "forward_lstm_1/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm_1/lstm_cell/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "backward_lstm_1/lstm_cell/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/kernel",
          "shape": [
            3,
            768,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/kernel",
          "shape": [
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            9
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            9
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}