{"format":"layers-model","generatedBy":"keras v3.12.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.12.0","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"inputShape":[12]}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"relu"}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"relu"}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":128,"activation":"linear","use_bias":false,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Activation","config":{"name":"activation_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"activation":"relu"}},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.2,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":7,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}],"build_input_shape":[null,12]}},"training_config":{"loss":"loss_fn","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":3.125000148429535e-05,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"sequential/batch_normalization/gamma","shape":[512],"dtype":"float32"},{"name":"sequential/batch_normalization/beta","shape":[512],"dtype":"float32"},{"name":"sequential/batch_normalization/moving_mean","shape":[512],"dtype":"float32"},{"name":"sequential/batch_normalization/moving_variance","shape":[512],"dtype":"float32"},{"name":"sequential/batch_normalization_1/gamma","shape":[256],"dtype":"float32"},{"name":"sequential/batch_normalization_1/beta","shape":[256],"dtype":"float32"},{"name":"sequential/batch_normalization_1/moving_mean","shape":[256],"dtype":"float32"},{"name":"sequential/batch_normalization_1/moving_variance","shape":[256],"dtype":"float32"},{"name":"sequential/batch_normalization_2/gamma","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/beta","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/moving_mean","shape":[128],"dtype":"float32"},{"name":"sequential/batch_normalization_2/moving_variance","shape":[128],"dtype":"float32"},{"name":"sequential/dense/kernel","shape":[12,512],"dtype":"float32"},{"name":"sequential/dense_1/kernel","shape":[512,256],"dtype":"float32"},{"name":"sequential/dense_2/kernel","shape":[256,128],"dtype":"float32"},{"name":"sequential/dense_3/kernel","shape":[128,7],"dtype":"float32"},{"name":"sequential/dense_3/bias","shape":[7],"dtype":"float32"}]}]}